<a href="https://colab.research.google.com/github/tewei0328/AI/blob/master/school_titanic_machine_learning_model1125.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.取得鐵達尼號完整資料集

In [0]:
import pandas as pd

In [0]:
titanic=pd.read_csv('https://raw.githubusercontent.com/tewei0328/data/master/titanic.csv')

In [16]:
titanic.shape

(1313, 11)

In [15]:
titanic.head()

   row.names pclass  survived  ...      ticket   boat     sex
0          1    1st         1  ...  24160 L221      2  female
1          2    1st         0  ...         NaN    NaN  female
2          3    1st         0  ...         NaN  (135)    male
3          4    1st         0  ...         NaN    NaN  female
4          5    1st         1  ...         NaN     11    male

[5 rows x 11 columns]

# 2.將資料切片成特徵X, 和答案y
並進一步切割成訓練集, 和測試集

In [0]:
X=titanic[['pclass','age','sex']]

In [19]:
X.head()

  pclass      age     sex
0    1st  29.0000  female
1    1st   2.0000  female
2    1st  30.0000    male
3    1st  25.0000  female
4    1st   0.9167    male

In [0]:
y=titanic[['survived']]

In [22]:
y

      survived
0            1
1            0
2            0
3            0
4            1
...        ...
1308         0
1309         0
1310         0
1311         0
1312         0

[1313 rows x 1 columns]

# 3. 將資料進一步切割成訓練集, 和測試集

In [0]:
from sklearn.model_selection import train_test_split